gap> ag := AffineSpace(4,5);
AG(4, 5)
gap> p := AffineSubspace(ag, [1,0,0,0] * One(GF(5)), 
>        [[1,0,0,-1], [0,1,0,0],[0,0,1,3]] * One(GF(5)));
&lt;a solid in AG(4, 5)>
gap> l := AffineSubspace(ag, [0,0,0,0] * One(GF(5)), [[1,1,0,0]] * One(GF(5)) );
&lt;a line in AG(4, 5)>
gap> x := Meet(p, l);
&lt;a point in AG(4, 5)>
gap> x^_;
[ Z(5)^0, Z(5)^0, 0*Z(5), 0*Z(5) ]
gap> Display(x);
Affine point: [ Z(5)^0, Z(5)^0, 0*Z(5), 0*Z(5) ]